
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// БондаренкоДМ ++
	ВКМ_ВидимостьДополнительныхЭлементовФормы();
	// БондаренкоДМ --
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// БондаренкоДМ ++
	ВКМ_ВидимостьДополнительныхЭлементовФормы();
	// БондаренкоДМ --
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВидимостьДополнительныхЭлементовФормы()
	
	Видимость = Объект.ВидДоговора = 
		ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость 		= Видимость;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость 	= Видимость;
	Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Видимость;
	Элементы.ВКМ_СтоимостьЧасаРабот.Видимость 				= Видимость;
	
КонецПроцедуры

#КонецОбласти
