
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Год = Параметры.Год;
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.Очистить();
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ДнейОтпуска = Значение.Данные.ДнейОтпуска + Строка.ДнейОтпуска;
		Если Строка.ДнейОтпуска > 28 Тогда
			Значение.ЦветФона = WebЦвета.СветлоРозовый;
		КонецЕсли;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
