
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ВКМ_ПланОтпусков
	Движения.ВКМ_ПланОтпусков.Записывать = Истина;
	Для Каждого ТекСтрока Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.ДатаНачала = ТекСтрока.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрока.ДатаОкончания;
		ДнейОтпуска = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала) /86400 + 1;
		Движение.ДнейОтпуска = ДнейОтпуска;
	КонецЦикла; 

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
